БухЭксп/Catalogs/CW_КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_КонтактнаяИнформация</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
				<xr:Item>Catalog.CW_КонтактыеЛица</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЛичнаяКИ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКИ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_КонтактнаяИнформация/Forms/ФормаВыбора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.КонтактнаяИнформация.РежимВыбора = Истина;
	
	Попытка
		
		Параметры.Отбор.Свойство("Владелец",ТекущийОбъектОтбора);
		
	Исключение
	    Отказ = Истина;
	КонецПопытки; 
	
	Заголовок = "Контактная информация ("+Строка(ТекущийОбъектОтбора)+")";
	
	_ОтборКонтактнойИнформации(ТекущийОбъектОтбора);
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);

КонецПроцедуры

// ---------------------------------------------------------------------------- 


#Область КонтактнаяИнформация

//&НаКлиенте
//Процедура ОтборКонтактнойИнформации(ОбъектОтбора)
//	// --- 
//	
//	_ОтборКонтактнойИнформации(ОбъектОтбора);
//	
//	// --- 
//КонецПроцедуры

&НаСервере
Процедура _ОтборКонтактнойИнформации(ОбъектОтбора)
	// --- 
	
	ТекущийОбъектОтбора = ОбъектОтбора;
	_ОбновитьКонтактнуюИнформацию();
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияПриАктивизацииСтроки(Элемент)
	
	Если (Элементы.КонтактнаяИнформация.ТекущиеДанные <> Неопределено) Тогда
		ТекущаяКонтактнаяИнформация = Элементы.КонтактнаяИнформация.ТекущиеДанные.Ссылка;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКонтактнуюИнформацию()
	// --- 
	
	_ОбновитьКонтактнуюИнформацию();
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ОбновитьКонтактнуюИнформацию()
	// --- 
	
	Если (ТекущийОбъектОтбора = Неопределено) Тогда
		Возврат;
	КонецЕсли; 
	
	// --- 
	Если (ТипЗнч(ТекущийОбъектОтбора) = Тип("СправочникСсылка.Контрагенты")) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_КонтактнаяИнформация.Ссылка,
		               |	CW_КонтактнаяИнформация.Наименование КАК ЗначениеКИ,
		               |	CW_КонтактнаяИнформация.ЛичнаяКИ,
		               |	CW_КонтактнаяИнформация.ВидКИ,
		               |	CW_КонтактнаяИнформация.ВидКИ.ТипКИ.СсылкаКартинки КАК АдресКартинки,
		               |	CW_КонтактнаяИнформация.Основной КАК ОсновнойВидКИ
		               |ИЗ
		               |	Справочник.CW_КонтактнаяИнформация КАК CW_КонтактнаяИнформация
		               |ГДЕ
		               |	CW_КонтактнаяИнформация.Владелец = &Владелец
		               |	И CW_КонтактнаяИнформация.ПометкаУдаления = ЛОЖЬ
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	CW_КонтактнаяИнформация.ВидКИ.Код
		               |АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("Владелец", ТекущийОбъектОтбора);
		ТЗ = Запрос.Выполнить().Выгрузить(); 
		
	ИначеЕсли (ТипЗнч(ТекущийОбъектОтбора) = Тип("СправочникСсылка.ФизическиеЛица")) Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_КонтактнаяИнформация.Ссылка,
		               |	CW_КонтактнаяИнформация.Наименование КАК ЗначениеКИ,
		               |	CW_КонтактнаяИнформация.ЛичнаяКИ,
		               |	CW_КонтактнаяИнформация.ВидКИ,
		               |	CW_КонтактнаяИнформация.ВидКИ.ТипКИ.СсылкаКартинки КАК АдресКартинки,
		               |	CW_КонтактнаяИнформация.Основной КАК ОсновнойВидКИ
		               |ИЗ
		               |	Справочник.CW_КонтактнаяИнформация КАК CW_КонтактнаяИнформация
		               |ГДЕ
		               |	CW_КонтактнаяИнформация.Владелец = &Владелец
		               |	И CW_КонтактнаяИнформация.ПометкаУдаления = ЛОЖЬ
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	CW_КонтактнаяИнформация.ВидКИ.Код
		               |АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("Владелец", ТекущийОбъектОтбора);
		ТЗ = Запрос.Выполнить().Выгрузить(); 
 		
	ИначеЕсли (ТипЗнч(ТекущийОбъектОтбора) = Тип("СправочникСсылка.CW_КонтактыеЛица")) Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_КонтактнаяИнформация.Ссылка,
		               |	CW_КонтактнаяИнформация.Наименование КАК ЗначениеКИ,
		               |	CW_КонтактнаяИнформация.ЛичнаяКИ,
		               |	CW_КонтактнаяИнформация.ВидКИ,
		               |	CW_КонтактнаяИнформация.ВидКИ.ТипКИ.СсылкаКартинки КАК АдресКартинки,
		               |	CW_КонтактнаяИнформация.Основной КАК ОсновнойВидКИ
		               |ИЗ
		               |	Справочник.CW_КонтактнаяИнформация КАК CW_КонтактнаяИнформация
		               |ГДЕ
		               |	(CW_КонтактнаяИнформация.Владелец = &Владелец
		               |			ИЛИ CW_КонтактнаяИнформация.Владелец = &ФизическоеЛицо)
		               |	И CW_КонтактнаяИнформация.ПометкаУдаления = ЛОЖЬ
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	CW_КонтактнаяИнформация.ВидКИ.Код
		               |АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("Владелец", ТекущийОбъектОтбора);
		Запрос.УстановитьПараметр("ФизическоеЛицо", ТекущийОбъектОтбора.ФизическоеЛицо); 
		ТЗ = Запрос.Выполнить().Выгрузить(); 
		
	КонецЕсли; 
	// --- 
	КартинкаЗвезда = БиблиотекаКартинок.CW_ПользовательМаленький;
	АдресКартинки = ПоместитьВоВременноеХранилище(КартинкаЗвезда.ПолучитьДвоичныеДанные(),УникальныйИдентификатор);
	// --- 
	КонтактнаяИнформация.Загрузить(ТЗ);
	// --- 
	Для каждого Стр Из КонтактнаяИнформация Цикл
		Если (Стр.ЛичнаяКИ) Тогда
			Стр.ПризнакЛичнойКИ = АдресКартинки;
		КонецЕсли; 
	КонецЦикла; 
	// --- 
	Если (ЗначениеЗаполнено(ТекущаяКонтактнаяИнформация)) Тогда
		ТекущаяСтрока = _сф.к_НайтиСтроку(КонтактнаяИнформация,Новый Структура("Ссылка",ТекущаяКонтактнаяИнформация));
		Если (ТекущаяСтрока <> Неопределено) Тогда
			Элементы.КонтактнаяИнформация.ТекущаяСтрока = ТекущаяСтрока.ПолучитьИдентификатор();
		КонецЕсли; 
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	// --- 
	ПФ = Новый Структура("ЗначенияЗаполнения",Новый Структура("Владелец",ТекущийОбъектОтбора));
	Если (Копирование) Тогда
		ПФ.Вставить("ЗначениеКопирования", Элементы.КонтактнаяИнформация.ТекущиеДанные.Ссылка);
	КонецЕсли; 
	ОткрытьФорму("Справочник.CW_КонтактнаяИнформация.ФормаОбъекта", ПФ, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// --- 
	ВыполнитьВыборКИ(Элементы.КонтактнаяИнформация.ТекущаяСтрока)
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	// --- 
	
	//ВыполнитьВыборКИ(Элементы.КонтактнаяИнформация.ТекущаяСтрока);
	
	Если (Элементы.КонтактнаяИнформация.ТекущиеДанные <> Неопределено) Тогда
		
		Если (Элемент.ТекущийЭлемент.Имя = "КонтактнаяИнформацияАдресКартинки") Тогда
			
			// переходим к КИ
			_УФК.ОткрытьКонтактнуюИнформацию(Элементы.КонтактнаяИнформация.ТекущиеДанные.Ссылка);
			
		Иначе
			
			ПФ = Новый Структура("Ключ",Элементы.КонтактнаяИнформация.ТекущиеДанные.Ссылка);
			ОткрытьФорму("Справочник.CW_КонтактнаяИнформация.ФормаОбъекта",ПФ,Элемент);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	ТекущаяКонтактнаяИнформация = НовыйОбъект;
	_ОбновитьКонтактнуюИнформацию();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаУдаленияКИ",ЭтотОбъект, Новый Структура());
	ПоказатьВопрос(ПОВ,"Удалить контактную информацию?",РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаУдаленияКИ(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ=КодВозвратаДиалога.Да) Тогда
			
			Результат = _ВыполнитьУдалениеКИ(Элементы.КонтактнаяИнформация.ТекущиеДанные.Ссылка);
			Если (_УФКС.ВыполненоУспешно(Результат)) Тогда
				Стр = КонтактнаяИнформация.НайтиПоИдентификатору(Элементы.КонтактнаяИнформация.ТекущаяСтрока);
				КонтактнаяИнформация.Удалить(Стр);
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _ВыполнитьУдалениеКИ(СсылкаКИ)
	// --- 
	
	Попытка
		КИ = СсылкаКИ.ПолучитьОбъект();
		КИ.УстановитьПометкуУдаления(Истина);	
	Исключение
	    Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
	КонецПопытки; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если (ИмяСобытия = "") Тогда
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	//Если (ВыбранноеЗначение <> Неопределено) Тогда
	//	
	//	ВладелецКИ = _ВладелецКИ(ВыбранноеЗначение);
	//	Если (ТипЗнч(ВладелецКИ)=Тип("СправочникСсылка.ФизическиеЛица")) Тогда
	//		
	//		Если (Элементы.СтраницыКонтрагентов.ТекущаяСтраница <> Элементы.СтраницаФизическиеЛица) Тогда
	//			Элементы.СтраницыКонтрагентов.ТекущаяСтраница = Элементы.СтраницаФизическиеЛица;
	//			ФормироватьДеревоКонтактныхЛиц = Ложь;
	//			ВидимостьРазделовФормы();	
	//		КонецЕсли; 
	//		// --- 
	//		Элементы.ФизическиеЛица.ТекущаяСтрока = ВладелецКИ;
	//		// --- 
	//		СтрокиКИ = КонтактнаяИнформация.НайтиСтроки(Новый Структура("Ссылка",ВыбранноеЗначение));
	//		Если (СтрокиКИ.Количество() <> 0) Тогда
	//			СтрокаКИ = СтрокиКИ[0];
	//			Элементы.КонтактнаяИнформация.ТекущаяСтрока = СтрокаКИ.ПолучитьИдентификатор();
	//		КонецЕсли; 
	//		
	//	Иначе
	//		
	//		Если (Элементы.СтраницыКонтрагентов.ТекущаяСтраница <> Элементы.СтраницаКонтрагенты) Тогда
	//			Элементы.СтраницыКонтрагентов.ТекущаяСтраница = Элементы.СтраницаКонтрагенты;	
	//			ФормироватьДеревоКонтактныхЛиц = Истина;
	//			ВидимостьРазделовФормы();
	//		КонецЕсли; 
	//		// --- 
	//		ТекущийОбъект = ВладелецКИ.Контрагент;
	//		Элементы.Контрагенты.ТекущаяСтрока = ТекущийОбъект;
	//		_СформироватьДерево();
	//		ОбновитьЛоготип();
	//		// --- 
	//		Если (ВладелецКИ.КонтактноеЛицо <> Неопределено) Тогда
	//			ТекущийОбъектОтбора = ВладелецКИ.КонтактноеЛицо;
	//		Иначе
	//			ТекущийОбъектОтбора = ТекущийОбъект;
	//		КонецЕсли; 
	//		_ОбновитьКонтактнуюИнформацию();
	//		// --- 
	//		// ищем строку контактного лица в дереве
	//		Если (ВладелецКИ.КонтактноеЛицо <> Неопределено) Тогда
	//			
	//			ИдентификаторСтрокиКЛ = _ИдентификаторСтрокиКЛ(ВладелецКИ.КонтактноеЛицо);
	//			Если (ИдентификаторСтрокиКЛ <> Неопределено ) Тогда
	//				Элементы.КонтактныеЛица.ТекущаяСтрока = ИдентификаторСтрокиКЛ;
	//				// --- 
	//				СтрокиКИ = КонтактнаяИнформация.НайтиСтроки(Новый Структура("Ссылка",ВыбранноеЗначение));
	//				Если (СтрокиКИ.Количество() <> 0) Тогда
	//					СтрокаКИ = СтрокиКИ[0];
	//					Элементы.КонтактнаяИнформация.ТекущаяСтрока = СтрокаКИ.ПолучитьИдентификатор();
	//				КонецЕсли; 
	//				// --- 
	//			КонецЕсли; 	
	//			
	//		Иначе
	//			
	//			СтрокиКИ = КонтактнаяИнформация.НайтиСтроки(Новый Структура("Ссылка",ВыбранноеЗначение));
	//			Если (СтрокиКИ.Количество() <> 0) Тогда
	//				СтрокаКИ = СтрокиКИ[0];
	//				Элементы.КонтактнаяИнформация.ТекущаяСтрока = СтрокаКИ.ПолучитьИдентификатор();
	//			КонецЕсли; 
	//			
	//		КонецЕсли; 
	//		
	//		
	//	КонецЕсли; 
	//	
	//КонецЕсли; 	
	
КонецПроцедуры

//&НаСервере
//Процедура _УстановитьКонтрагента(Контрагент)
//	// --- 
//	
//	Элементы.Контрагенты.ТекущаяСтрока = Контрагент;
//	
//	// --- 
//КонецПроцедуры
// 

//&НаСервере
//Функция _ИдентификаторСтрокиКЛ(КЛ)
//	// --- 
//	
//	Возврат(_НайтиСтрокуДерева(КЛ,КонтактныеЛица));
//	
//	// --- 
//КонецФункции

//&НаСервере
//Функция _НайтиСтрокуДерева(СсылкаКЛ,ЭлементДерева)
//	// --- 
//	
//	СтрокаКЛ = Неопределено;
//	
//	Для каждого СтрокаДерева Из ЭлементДерева.ПолучитьЭлементы() Цикл
//		
//		Если (СтрокаДерева.Ссылка = СсылкаКЛ) Тогда
//			
//			Возврат(СтрокаДерева.ПолучитьИдентификатор());
//			
//		Иначе
//			
//			СтрокаКЛ = _НайтиСтрокуДерева(СсылкаКЛ, СтрокаДерева);
//			Если (СтрокаКЛ <> Неопределено) Тогда
//				
//				Возврат(СтрокаКЛ);
//				
//			КонецЕсли; 
//			
//		КонецЕсли; 
//		
//	КонецЦикла; 
//	
//	Возврат(СтрокаКЛ);
//	
//	// --- 
//КонецФункции
// 

//&НаСервере
//Функция _ВладелецКИ(КИ)
//	// --- 
//	
//	Если (ТипЗнч(КИ.Владелец)=Тип("СправочникСсылка.ФизическиеЛица")) Тогда
//		
//		Возврат(КИ.Владелец);
//		
//	Иначе
//		
//		Если (ТипЗнч(КИ.Владелец)=Тип("СправочникСсылка.Контрагенты")) Тогда
//			Возврат(Новый Структура("Контрагент,КонтактноеЛицо",КИ.Владелец,Неопределено));
//		Иначе
//			Возврат(Новый Структура("Контрагент,КонтактноеЛицо",КИ.Владелец.Владелец,КИ.Владелец));
//		КонецЕсли; 
//		
//	КонецЕсли; 
//	
//	// --- 
//КонецФункции

// --- 

&НаКлиенте
Процедура ОбновитьКонтактнуюИнформацию1(Команда)
	
	ОбновитьКонтактнуюИнформацию();
	
КонецПроцедуры


// ---------------------------------------------------------------------------- 

#КонецОбласти 

// ---------------------------------------------------------------------------- 


&НаКлиенте
Процедура ВыбратьКИ(Команда)
	
	Если (Элементы.КонтактнаяИнформация.ТекущаяСтрока <> Неопределено) Тогда
		
		ВыполнитьВыборКИ(Элементы.КонтактнаяИнформация.ТекущаяСтрока);
		
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыборКИ(Идентификатор)
	// --- 
	
	ЭтаФорма.Закрыть(КонтактнаяИнформация.НайтиПоИдентификатору(Идентификатор).Ссылка);
	
	// --- 
КонецПроцедуры


#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти
